<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Resources/Info.plist</key>
		<data>
		LcTXxBRrhGEGeYRGIlKeadCq+uU=
		</data>
		<key>Resources/OnsetDetectionCNN.mlmodelc/analytics/coremldata.bin</key>
		<data>
		soh1ZL8sTDTfTz589Gp639qtCqE=
		</data>
		<key>Resources/OnsetDetectionCNN.mlmodelc/coremldata.bin</key>
		<data>
		mHvaY2/9rokZ6l9ehgV18UQS+fU=
		</data>
		<key>Resources/OnsetDetectionCNN.mlmodelc/metadata.json</key>
		<data>
		yp6G+CDl2QvhaxrQo/MgdyD9DIU=
		</data>
		<key>Resources/OnsetDetectionCNN.mlmodelc/model.espresso.net</key>
		<data>
		GOvBGgd0SxoAqrGSDk+pVPL6Z9w=
		</data>
		<key>Resources/OnsetDetectionCNN.mlmodelc/model.espresso.shape</key>
		<data>
		FILDXXd5Px+aJcAR8nRAD2Tm+ec=
		</data>
		<key>Resources/OnsetDetectionCNN.mlmodelc/model.espresso.weights</key>
		<data>
		7vqFed/UkeLi8m7KaprtrqdedFA=
		</data>
		<key>Resources/OnsetDetectionCNN.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>Resources/OnsetDetectionCNN.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Resources/version.plist</key>
		<data>
		RDsP3Ziuy/R+vje4SBMJ0pCe1Tw=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Resources/Info.plist</key>
		<dict>
			<key>hash</key>
			<data>
			LcTXxBRrhGEGeYRGIlKeadCq+uU=
			</data>
			<key>hash2</key>
			<data>
			LjdYWggCgwhvIAR/C9J3835T2q6GjmGhVCAOzsH8eMw=
			</data>
		</dict>
		<key>Resources/OnsetDetectionCNN.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			soh1ZL8sTDTfTz589Gp639qtCqE=
			</data>
			<key>hash2</key>
			<data>
			Jic9JUdATx2LFAY1+Q1w6VjwaRXDKgG4ZMfwrum5g6g=
			</data>
		</dict>
		<key>Resources/OnsetDetectionCNN.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			mHvaY2/9rokZ6l9ehgV18UQS+fU=
			</data>
			<key>hash2</key>
			<data>
			MUHqlz/1VIcK7+PBqu4IRSBNtdcyxhgybBL0oj7e4K4=
			</data>
		</dict>
		<key>Resources/OnsetDetectionCNN.mlmodelc/metadata.json</key>
		<dict>
			<key>hash</key>
			<data>
			yp6G+CDl2QvhaxrQo/MgdyD9DIU=
			</data>
			<key>hash2</key>
			<data>
			idKzWHVbxcvi5147twGkcXqtgKGQrWrQdN5r0DP+sf8=
			</data>
		</dict>
		<key>Resources/OnsetDetectionCNN.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash</key>
			<data>
			GOvBGgd0SxoAqrGSDk+pVPL6Z9w=
			</data>
			<key>hash2</key>
			<data>
			loLZP8yfh04T7qcaA02xTXehyOc3bxrgl8xefV58Umg=
			</data>
		</dict>
		<key>Resources/OnsetDetectionCNN.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash</key>
			<data>
			FILDXXd5Px+aJcAR8nRAD2Tm+ec=
			</data>
			<key>hash2</key>
			<data>
			YW7qOg+1MvMnDawAMU6doUycuP2/XBiaUOpEHNlR1QQ=
			</data>
		</dict>
		<key>Resources/OnsetDetectionCNN.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash</key>
			<data>
			7vqFed/UkeLi8m7KaprtrqdedFA=
			</data>
			<key>hash2</key>
			<data>
			J/LXRXJ72FAsZ6uRBH9PTUNRppT+q9BVGTkfmgnKMC8=
			</data>
		</dict>
		<key>Resources/OnsetDetectionCNN.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			yNfQ7w7t+oLS6hqlkoRbmm1LArc=
			</data>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>Resources/OnsetDetectionCNN.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash</key>
			<data>
			uA3l0Th1hUHF8FJlrRRKufqG0ds=
			</data>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Resources/version.plist</key>
		<dict>
			<key>hash</key>
			<data>
			RDsP3Ziuy/R+vje4SBMJ0pCe1Tw=
			</data>
			<key>hash2</key>
			<data>
			GPA/bSf0Jcm/8YunzD5S6qTQ3FfH4Dq92QQZFIgjalE=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^Resources/</key>
		<true/>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^(Frameworks|SharedFrameworks|PlugIns|Plug-ins|XPCServices|Helpers|MacOS|Library/(Automator|Spotlight|LoginItems))/</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^[^/]+$</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
